/**
 * @description
 * @author 阿怪
 * @date 2024/1/7 18:37
 * @version v1.0.0
 *
 * 江湖的业务千篇一律，复杂的代码好几百行。
 */

export type TianGanType = '甲' | '乙' | '丙' | '丁' | '戊' | '己' | '庚' | '辛' | '壬' | '癸';
export type DiZhiType = '子' | '丑' | '寅' | '卯' | '辰' | '巳' | '午' | '未' | '申' | '酉' | '戌' | '亥';
export type JiaZiType = `${TianGanType}${DiZhiType}`;
export type SolarTermType = '小寒' | '大寒' | '立春' | '雨水' | '惊蛰' | '春分' | '清明' | '谷雨' | '立夏' | '小满' | '芒种' | '夏至' |
  '小暑' | '大暑' | '立秋' | '处暑' | '白露' | '秋分' | '寒露' | '霜降' | '立冬' | '小雪' | '大雪' | '冬至';

// 天干 甲、乙、丙、丁、戊、己、庚、辛、壬、癸
export const TianGan: TianGanType[] = ['甲', '乙', '丙', '丁', '戊', '己', '庚', '辛', '壬', '癸'];
// 地支 子、丑、寅、卯、辰、巳、午、未、申、酉、戌、亥
export const DiZhi: DiZhiType[]
  = ['子', '丑', '寅', '卯', '辰', '巳', '午', '未', '申', '酉', '戌', '亥'];

export const LiuShiJiaZi: JiaZiType[] = [
  '甲子', '乙丑', '丙寅', '丁卯', '戊辰', '己巳', '庚午', '辛未', '壬申', '癸酉',
  '甲戌', '乙亥', '丙子', '丁丑', '戊寅', '己卯', '庚辰', '辛巳', '壬午', '癸未',
  '甲申', '乙酉', '丙戌', '丁亥', '戊子', '己丑', '庚寅', '辛卯', '壬辰', '癸巳',
  '甲午', '乙未', '丙申', '丁酉', '戊戌', '己亥', '庚子', '辛丑', '壬寅', '癸卯',
  '甲辰', '乙巳', '丙午', '丁未', '戊申', '己酉', '庚戌', '辛亥', '壬子', '癸丑',
  '甲寅', '乙卯', '丙辰', '丁巳', '戊午', '己未', '庚申', '辛酉', '壬戌', '癸亥',
];

export const SOLAR_TERMS_NAME_LIST: SolarTermType[] = [
  '小寒', '大寒', // 农历十二月
  '立春', '雨水', // 农历正月
  '惊蛰', '春分', // 农历二月
  '清明', '谷雨', // 农历三月
  '立夏', '小满', // 农历四月
  '芒种', '夏至', // 农历五月
  '小暑', '大暑', // 农历六月
  '立秋', '处暑', // 农历七月
  '白露', '秋分', // 农历八月
  '寒露', '霜降', // 农历九月
  '立冬', '小雪', // 农历十月
  '大雪', '冬至',  // 农历十一月
];

export type TermInfoType = {
  m: number;
  d: number;
  term: string;
}

export const KE = [
  '初刻', '半刻',
  '一刻', '一刻半',
  '二刻', '二刻半',
  '三刻', '三刻半',
  '四刻', '四刻半',
  '五刻', '五刻半',
  '六刻', '六刻半',
  '七刻', '七刻半',
  '八刻',
];

export type LunarType = {
  year: JiaZiType;
  month?: JiaZiType;
  day?: JiaZiType;
  hour?: string;
  minute?: string;
  lunarDate: {
    year: number;
    month: number;
    day: number;
    isLeap: boolean;
  },
  term?: string;
}
